In [1]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('archive/basic2.csv', parse_dates=['Date'], index_col=0)

In [3]:
df.head()

               Sales      PV      UV  Events
Date
2022-01-01  22711525  397349  4421.0       1
2022-01-02     36779    3969  2289.0       0
2022-01-03  13943875  373890     NaN       1
2022-01-04   8088593  142054  2157.0       0
2022-01-05   2395374  190684     NaN       0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 730 entries, 2022-01-01 to 2023-12-31
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   730 non-null    int64
 1   PV      730 non-null    int64
 2   UV      684 non-null    float64
 3   Events  730 non-null    int64
dtypes: float64(1), int64(3)
memory usage: 28.5 KB

In [6]:
df.tail()

               Sales      PV      UV  Events
Date
2023-12-27  33846609  415067  7360.0       1
2023-12-28   3659566  208601  2262.0       1
2023-12-29   1164008   14309   193.0       0
2023-12-30   3977696   60935     NaN       0
2023-12-31   3719764   60963  1507.0       0

In [12]:
df_w = df.resample('W').sum()
df_m = df.resample('M').sum()

df_w.head()

/var/folders/3r/nmmcqm2j7sxcf3xbrvvkslvr0000gn/T/ipykernel_30207/2254350577.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df_m = df.resample('M').sum()

               Sales       PV       UV  Events
Date
2022-01-02  22748304   401318   6710.0       1
2022-01-09  33373822  1148464  15189.0       2
2022-01-16  20754519   283773   9344.0       0
2022-01-23  21880751   538633   9841.0       1
2022-01-30  28878452   560814   7808.0       1

In [13]:
df_m.head()

                Sales       PV       UV  Events
Date
2022-01-31  129342654  3079961  50366.0       5
2022-02-28  180741394  3298119  68908.0       9
2022-03-31  200161616  4726549  86131.0       9
2022-04-30  126811278  3212413  57795.0       6
2022-05-31  141285007  3523070  58316.0       7

In [9]:
ma = df_w['Sales'].max()

ma

99165648

In [10]:
mi = df_w['Sales'].min()
mi

7526598

In [11]:
print(ma - mi)

91639050